In [4]:
# operations :groupby/merge/jions
# two ways to perform groupby operation
# 1..)dataframe.groupby('key')
# 2..)dataframe.groupby(['key1','key2'])
import pandas as pd
ipl_data={"team":['Rinders','Rinders','Devils','Devils','Kings','Kings','kings','Kings','Rinders','Royals','Rinders'],
           'Rank':[1,2,2,3,4,1,1,2,4,1,2],
           'Year':[2014,2015,2014,2015,2014,2015,2015,2016,2017,2016,2014],
           'points':[876,789,863,673,714,812,756,694,701,804,690]
}
df=pd.DataFrame(ipl_data)
df

       team  Rank  Year  points
0   Rinders     1  2014     876
1   Rinders     2  2015     789
2    Devils     2  2014     863
3    Devils     3  2015     673
4     Kings     4  2014     714
5     Kings     1  2015     812
6     kings     1  2015     756
7     Kings     2  2016     694
8   Rinders     4  2017     701
9    Royals     1  2016     804
10  Rinders     2  2014     690

In [5]:
df.groupby('team')

In [6]:
df.groupby('team').groups

{'Devils': [2, 3], 'Kings': [4, 5, 7], 'Rinders': [0, 1, 8, 10], 'Royals': [9], 'kings': [6]}

In [14]:
df.groupby(['team','Year']).groups

{('Devils', 2014): [2], ('Devils', 2015): [3], ('Kings', 2014): [4], ('Kings', 2015): [5], ('Kings', 2016): [7], ('Rinders', 2014): [0, 10], ('Rinders', 2015): [1], ('Rinders', 2017): [8], ('Royals', 2016): [9], ('kings', 2015): [6]}

In [16]:
df.groupby('Year')

In [17]:
grouped=df.groupby('Year')
for i in grouped:
    print(i)

(2014,        team  Rank  Year  points
0   Rinders     1  2014     876
2    Devils     2  2014     863
4     Kings     4  2014     714
10  Rinders     2  2014     690)
(2015,       team  Rank  Year  points
1  Rinders     2  2015     789
3   Devils     3  2015     673
5    Kings     1  2015     812
6    kings     1  2015     756)
(2016,      team  Rank  Year  points
7   Kings     2  2016     694
9  Royals     1  2016     804)
(2017,       team  Rank  Year  points
8  Rinders     4  2017     701)

In [18]:
grouped1=df.groupby('team')
for i in grouped1:
    print(i)

('Devils',      team  Rank  Year  points
2  Devils     2  2014     863
3  Devils     3  2015     673)
('Kings',     team  Rank  Year  points
4  Kings     4  2014     714
5  Kings     1  2015     812
7  Kings     2  2016     694)
('Rinders',        team  Rank  Year  points
0   Rinders     1  2014     876
1   Rinders     2  2015     789
8   Rinders     4  2017     701
10  Rinders     2  2014     690)
('Royals',      team  Rank  Year  points
9  Royals     1  2016     804)
('kings',     team  Rank  Year  points
6  kings     1  2015     756)

In [20]:
df.groupby("Year").get_group(2014)

       team  Rank  Year  points
0   Rinders     1  2014     876
2    Devils     2  2014     863
4     Kings     4  2014     714
10  Rinders     2  2014     690

In [21]:
grups=df.groupby('team')
grups

In [22]:
import pandas as pd
import numpy as np
grups['points'].agg(np.sum)

C:\Users\HP\AppData\Local\Temp\ipykernel_14216\2181905782.py:3: FutureWarning: The provided callable <function sum at 0x000001FA087551C0> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  grups['points'].agg(np.sum)

team
Devils     1536
Kings      2220
Rinders    3056
Royals      804
kings       756
Name: points, dtype: int64

In [23]:
grups1=df.groupby('team')
grups1.agg(np.size)

         Rank  Year  points
team
Devils      2     2       2
Kings       3     3       3
Rinders     4     4       4
Royals      1     1       1
kings       1     1       1

In [25]:
grups['points'].count()
grups.count()
grups.sum()

         Rank  Year  points
team
Devils      5  4029    1536
Kings       7  6045    2220
Rinders     9  8060    3056
Royals      1  2016     804
kings       1  2015     756

In [29]:
grups['points'].agg([np.sum,np.mean,np.std])
df

C:\Users\HP\AppData\Local\Temp\ipykernel_14216\198295868.py:1: FutureWarning: The provided callable <function sum at 0x000001FA087551C0> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  grups['points'].agg([np.sum,np.mean,np.std])
C:\Users\HP\AppData\Local\Temp\ipykernel_14216\198295868.py:1: FutureWarning: The provided callable <function mean at 0x000001FA087565C0> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  grups['points'].agg([np.sum,np.mean,np.std])
C:\Users\HP\AppData\Local\Temp\ipykernel_14216\198295868.py:1: FutureWarning: The provided callable <function std at 0x000001FA08756700> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  grups['points'].agg([np.sum,np.mean,np.std])

       team  Rank  Year  points
0   Rinders     1  2014     876
1   Rinders     2  2015     789
2    Devils     2  2014     863
3    Devils     3  2015     673
4     Kings     4  2014     714
5     Kings     1  2015     812
6     kings     1  2015     756
7     Kings     2  2016     694
8   Rinders     4  2017     701
9    Royals     1  2016     804
10  Rinders     2  2014     690

In [30]:
df.groupby('team')

In [31]:
grouped_value=df.groupby('team')
grouped_value

In [32]:
lambda x:(x-x.mean())/x.std()

In [5]:
import pandas as pd
dataset=pd.read_csv('titanic.csv')
print(dataset)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [6]:
dataset.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [8]:
dataset[['Name']]

                                                  Name
0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
..                                                 ...
886                              Montvila, Rev. Juozas
887                       Graham, Miss. Margaret Edith
888           Johnston, Miss. Catherine Helen "Carrie"
889                              Behr, Mr. Karl Howell
890                                Dooley, Mr. Patrick

[891 rows x 1 columns]

In [12]:
dataset[['Name','Age','Sex']]

                                                  Name   Age     Sex
0                              Braund, Mr. Owen Harris  22.0    male
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female
2                               Heikkinen, Miss. Laina  26.0  female
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  female
4                             Allen, Mr. William Henry  35.0    male
..                                                 ...   ...     ...
886                              Montvila, Rev. Juozas  27.0    male
887                       Graham, Miss. Margaret Edith  19.0  female
888           Johnston, Miss. Catherine Helen "Carrie"   NaN  female
889                              Behr, Mr. Karl Howell  26.0    male
890                                Dooley, Mr. Patrick  32.0    male

[891 rows x 3 columns]

In [13]:
dataset['Name'].value_counts()

Name
Dooley, Mr. Patrick                                    1
Braund, Mr. Owen Harris                                1
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    1
Heikkinen, Miss. Laina                                 1
Futrelle, Mrs. Jacques Heath (Lily May Peel)           1
                                                      ..
Hewlett, Mrs. (Mary D Kingcome)                        1
Vestrom, Miss. Hulda Amanda Adolfina                   1
Andersson, Mr. Anders Johan                            1
Saundercock, Mr. William Henry                         1
Bonnell, Miss. Elizabeth                               1
Name: count, Length: 891, dtype: int64

In [1]:
lambda x:(x-x.mean())/x.std()
z_score=lambda x:(x-x.mean()/x.std())

In [ ]:
# import pandas as pd
# grouped_value.transform(z_score)
# df.groupby('team').filter(lambda x:len(x)>=3)